app/controllers/bills_controller.rb

SELECT  `contract_installations`.* FROM `contract_installations` WHERE `contract_installations`.`id` = NULL LIMIT 1
---
  def new
    @contract_installation = ContractInstallation.find(params[:id])