app/controllers/contract_installations_controller.rb

  def new
    @installation = Installation.find(params[:id])
---
SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1

  def create

    @installation = Installation.find(params[:id])
---
SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1

  def create
    @installation = Installation.find(params[:id])
    @contract_installation = @installation.contract_installations.build(contract_installation_params)
    if @contract_installation.save
---
INSERT INTO `contract_installations` (`start_date`, `finish_date`, `created_at`, `updated_at`, `contrato_de_instalacion_doc_file_name`, `contrato_de_instalacion_doc_content_type`, `contrato_de_instalacion_doc_file_size`, `contrato_de_instalacion_doc_updated_at`, `installation_id`) VALUES ('2018-06-27 00:00:00', '2018-06-28 00:00:00', '2018-06-26 06:32:59', '2018-06-26 06:32:59', 'jurasica1.pdf', 'application/pdf', 142351, '2018-06-26 06:32:59', 1)

  def show
    @contract_installation=ContractInstallation.find(params[:id])
---
SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
SELECT `contract_installations`.* FROM `contract_installations` WHERE `contract_installations`.`installation_id` = 1