app/controllers/contract_guards_controller.rb

  def new
    @guard = Guard.find(params[:id])
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = NULL LIMIT 1

  def create
    @guard = Guard.find(params[:id])
    @contract_guard = @guard.contract_guards.build(contract_guard_params)
    if @contract_guard.save
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
INSERT INTO `contract_guards` (`start_date`, `finish_date`, `created_at`, `updated_at`, `contrato_doc_file_name`, `contrato_doc_content_type`, `contrato_doc_file_size`, `contrato_doc_updated_at`, `guard_id`) VALUES ('2018-06-26 00:00:00', '2018-06-28 00:00:00', '2018-06-26 02:53:15', '2018-06-26 02:53:15', 'jurasica1.pdf', 'application/pdf', 142351, '2018-06-26 02:53:15', 1)

  def show
    @guard = Guard.find(params[:id])
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1

  def set_contract_guard
    @contract_guard = ContractGuard.find(params[:id])
---
SELECT  `contract_guards`.* FROM `contract_guards` WHERE `contract_guards`.`id` = 1 LIMIT 1