app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
  def index
    @events=Event.all

SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
---
  def new
    @installation = Installation.find(params[:id])

SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
INSERT INTO `events` (`name`, `factura_evento_doc_file_name`, `factura_evento_doc_content_type`, `factura_evento_doc_file_size`, `factura_evento_doc_updated_at`, `date`, `installation_id`, `created_at`, `updated_at`) VALUES ('Comic Con', 'paper-sizes-large.jpg', 'image/jpeg', 101436, '2018-06-30 02:12:08', '2018-06-30 00:00:00', 2, '2018-06-30 02:12:09', '2018-06-30 02:12:09')
---
  def create

    @installation = Installation.find(params[:id])
    @event = @installation.events.build(events_params)
    if @event.save

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
  def edit
    @event = Event.find(params[:id])

SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
---
  def show
    @installation = Installation.find(params[:id])

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
  def set_event
    @event = Event.find(params[:id])