app/controllers/guards_controller.rb

SELECT `guards`.* FROM `guards` WHERE (rut LIKE '%18.117.016-6%')
---
  def index
    @guards=Guard.all

INSERT INTO `guards` (`rut`, `phone_number`, `email`, `nationality`, `created_at`, `updated_at`, `firstname`, `lastname`, `surname`, `age`, `sex`, `city`, `commune`, `address`, `educational_level`, `second_phone`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `ficha_guardia_doc_file_name`, `ficha_guardia_doc_content_type`, `ficha_guardia_doc_file_size`, `ficha_guardia_doc_updated_at`) VALUES ('18367419-6', '996201038', 'paburtonavarro@gmail.com', 'Chilena', '2018-05-18 16:35:23', '2018-05-18 16:35:23', 'Paulina', 'Aburto', 'Navarro', 18, 'Femenino', 'Santiago', 'Estación central', 'Psje Cerro Granito 3906', 'Superior completa', '228915882', 'perfilpau.jpg', 'image/jpeg', 84179, '2018-05-18 16:35:23', 'foto_perfil.jpg', 'image/jpeg', 54652, '2018-05-18 16:35:23')
---
  def create
     @guard = Guard.new(guard_params)
     @guard.active = true
     respond_to do |format|
       if @guard.valid?
         if @guard.save

SELECT `guards`.* FROM `guards` WHERE `guards`.`id` IN (NULL, NULL)
---
   def search
    q = params[:rut]
    @guards = Guard.find(:all, :conditions => ["rut LIKE %?%",q])

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 12 LIMIT 1
---
  def edit
    @guard = Guard.find(params[:id])

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 12 LIMIT 1
UPDATE `guards` SET `city` = 'Santiago', `commune` = 'Estación central', `educational_level` = 'Basica incompleta', `avatar_file_name` = 'Captura_de_pantalla_2017-04-02_20-31-22.png', `avatar_content_type` = 'image/png', `avatar_file_size` = 33000, `avatar_updated_at` = '2018-05-22 16:03:14', `updated_at` = '2018-05-22 16:03:15' WHERE `guards`.`id` = 25
---
  def update
    @guard = Guard.find(params[:id])
    if @guard.update(guard_params)

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 13 LIMIT 1
DELETE FROM `guards` WHERE `guards`.`id` = 13
---
  def delete
    @guard = Guard.find(params[:id])
    @guard.destroy

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 11 LIMIT 1
---
  def show
    @guard=Guard.find(params[:id])

SELECT `guards`.* FROM `guards` WHERE `guards`.`id` IN (NULL, NULL)
---
  def set_guard
    @guard = Guard.find(params[:id])