app/controllers/installations_controller.rb

SELECT `installations`.* FROM `installations`
---
  def index
    @installations=Installation.all

INSERT INTO `installations` (`name`, `number_guards`, `additional_guards`, `date`, `created_at`, `updated_at`) VALUES ('Movistar Arena', 7, 0, '2018-05-21 00:00:00', '2018-05-28 23:37:06', '2018-05-28 23:37:06')
---
  def create
     @installation = Installation.new(installations_params)
     respond_to do |format|
       if @installation.valid?
         if @installation.save

SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
---
  def edit
    @installation = Installation.find(params[:id])

SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
UPDATE `installations` SET `date` = '2018-05-22 00:00:00', `updated_at` = '2018-05-28 23:36:15' WHERE `installations`.`id` = 1
---
  def update
    @installation = Installation.find(params[:id])
    if @installation.update(installations_params)

SELECT  `installations`.* FROM `installations` WHERE `installations`.`id` = 1 LIMIT 1
---
  def show
    @installation=Installation.find(params[:id])