app/controllers/osdocumentations_controller.rb

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
---
  def new
    #@vacation = Vacation.new
    @guard = Guard.find(params[:id])

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
INSERT INTO `osdocumentations` (`guard_id`, `expiration`, `certificado_os10_doc_file_name`, `certificado_os10_doc_content_type`, `certificado_os10_doc_file_size`, `certificado_os10_doc_updated_at`, `state`) VALUES (1, '2018-06-21 00:00:00', 'paper-sizes-large.jpg', 'image/jpeg', 101436, '2018-06-20 13:57:43', 1)
---
  def create
    @guard = Guard.find(params[:id])
    @osdocumentation = @guard.osdocumentations.build(osdocumentation_params)
    if @osdocumentation.save

SELECT  `osdocumentations`.* FROM `osdocumentations` WHERE `osdocumentations`.`id` = 1 LIMIT 1
---
  def edit
    @osdocumentation = Osdocumentation.find(params[:id])

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
---
  def show
    @guard = Guard.find(params[:id])

SELECT  `osdocumentations`.* FROM `osdocumentations` WHERE (`osdocumentations`.`id` = 1 OR `osdocumentations`.`id` IS NULL) LIMIT 1
---
  def set_osdocumentation
    @osdocumentation = Osdocumentation.find(params[:id])