app/controllers/sallary_settlements_controller.rb

SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
INSERT INTO `sallary_settlements` (`cost`, `date`, `created_at`, `updated_at`, `liquidacion_doc_file_name`, `liquidacion_doc_content_type`, `liquidacion_doc_file_size`, `liquidacion_doc_updated_at`, `guard_id`) VALUES (8, '2018-06-21 00:00:00', '2018-06-20 12:48:37', '2018-06-20 12:48:37', 'paper-sizes-large.jpg', 'image/jpeg', 101436, '2018-06-20 12:48:36', 1)
---
  def create
    @guard = Guard.find(params[:id])
    @sallary_settlement = @guard.sallary_settlements.build(sallary_settlement_params)
    if @sallary_settlement.save

SELECT  `sallary_settlements`.* FROM `sallary_settlements` WHERE `sallary_settlements`.`id` = 1 LIMIT 1
---
  def edit
    @sallary_settlement = SallarySettlement.find(params[:id])

SELECT  `sallary_settlements`.* FROM `sallary_settlements` WHERE `sallary_settlements`.`id` = 1 LIMIT 1
---
   def show
    @sallary_settlement=SallarySettlement.find(params[:id])