app/controllers/search_controller.rb

SELECT `guards`.* FROM `guards` WHERE (rut LIKE '10.249.768-6')
---
    def create
        palabra = params[:keyword]
        @guard = Guard.where("rut LIKE ?", palabra)