app/controllers/settlements_controller.rb

  def new
    #@vacation = Vacation.new
    @guard = Guard.find(params[:id])
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1

  def create
    @guard = Guard.find(params[:id])
    @settlement = @guard.settlements.build(settlement_params)
    if @settlement.save
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
INSERT INTO `settlements` (`created_at`, `updated_at`, `finiquito_doc_file_name`, `finiquito_doc_content_type`, `finiquito_doc_file_size`, `finiquito_doc_updated_at`, `guard_id`, `date`, `observation`) VALUES ('2018-06-20 15:14:48', '2018-06-20 15:14:48', 'paper-sizes-large.jpg', 'image/jpeg', 101436, '2018-06-20 15:14:47', 1, '2018-06-28 00:00:00', 'lndclkndclknsdlkcnslakdnclksndclkndslcknsdlcnpisdjpisncisndpcinsoidncpisdncpindc')

  def edit
    @settlement = Settlement.find(params[:id])
---
SELECT  `settlements`.* FROM `settlements` WHERE `settlements`.`id` = 2 LIMIT 1

  def show
    @guard = Guard.find(params[:id])
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1

  def set_settlement
    @settlement = Settlement.find(params[:id])
---
SELECT  `settlements`.* FROM `settlements` WHERE `settlements`.`id` = 2 LIMIT 1