app/controllers/vacations_controller.rb

  def new
    #@vacation = Vacation.new
    @guard = Guard.find(params[:id])
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 4 LIMIT 1

  def create
    @guard = Guard.find(params[:id])
    @vacation = @guard.vacations.build(vacation_params)
    if @vacation.save
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 1 LIMIT 1
INSERT INTO `vacations` (`days_taken`, `created_at`, `updated_at`, `vacacion_doc_file_name`, `vacacion_doc_content_type`, `vacacion_doc_file_size`, `vacacion_doc_updated_at`, `guard_id`) VALUES (8, '2018-06-19 04:39:34', '2018-06-19 04:39:34', 'mano.jpg', 'image/jpeg', 86099, '2018-06-19 04:39:33', 1)

  def edit
    @vacation = Vacation.find(params[:id])
---
SELECT  `vacations`.* FROM `vacations` WHERE `vacations`.`id` = 1 LIMIT 1

  def update
    @vacation = Vacation.find(params[:id])
    if @vacation.update(vacation_params)
---
SELECT  `vacations`.* FROM `vacations` WHERE `vacations`.`id` = 1 LIMIT 1
UPDATE `vacations` SET `days_taken` = 3, `vacacion_doc_file_name` = '35299211_10216358283331981_868020797556391936_n.png', `vacacion_doc_content_type` = 'image/png', `vacacion_doc_file_size` = 761809, `vacacion_doc_updated_at` = '2018-06-19 04:45:57', `updated_at` = '2018-06-19 04:45:59' WHERE `vacations`.`id` = 1

  def show
    @vacation=Vacation.find(params[:id])
---
SELECT  `vacations`.* FROM `vacations` WHERE `vacations`.`id` = 0 LIMIT 1

  def show
    @guard = Guard.find(params[:id])
---
SELECT  `guards`.* FROM `guards` WHERE `guards`.`id` = 4 LIMIT 1